/*************************************************************************
  >  File  Name  : scopeStack.c
  >    Author    : lirongwei
  >     Mail     : a2413044193@gmail.com
  > Created Time : 2020/07/06 10:42:22
 ************************************************************************/

#include <stdio.h>

/*
 * 作用域叠加 ---> 全局变量同局部变量的作用域叠加
 * 在不同的作用域，可以有重名的标识符
 * 局部变量会覆盖全局变量的作用域
 *
 * 更小的作用域，只能用于再次划分局部的作用域
 */

int a = 100;

int main(int argc, char** argv) {
    int a = 10;
    {
        int a = 1;
        printf("%d\n", a);
    }
    return 0;
}
